# MeshTriangle Class

---
One triangle of a mesh.
SystemObject Autodesk.Revit.DBMeshTriangle
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class MeshTriangle

    Public Class MeshTriangle

    public ref class MeshTriangle

    type MeshTriangle = class end
The MeshTriangle type exposes the following members.
| Name| Description
---|---|---
| Index| The index of the vertex in the Vertices array of the mesh, for indexed access.
| Vertex| A vertex of the triangle.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace